package day12.book;
/*
	혼자 실습 , 도서관리 프로그램
		1. 초기메뉴 : 회원가입 , 로그인 제공합니다.
		2. 회원가입시 일반인 인지 관리자 인지 구분하여 가입을 진행합니다.
		3. 로그인시 일반인 인지 관리자 인지 구분하여 로그인을 진행합니다.
		4. 로그인 성공시
			4-1 관리자인경우 메뉴 : 1.도서등록 2.도서목록 제공합니다.
			4-2 일반인인경우 메뉴 : 1.도서대여 2.도서반납 3.대여현황 제공 합니다.
		5. 관리자는 도서정보를 입력받아 도서등록 처리 합니다.
		6. 관리자는 현재 등록된 모든 도서목록을 출력 합니다.
		7. 일반인은 도서 대여시 대여할 도서번호를 입력받아 대여가 가능하면 대여를 진행합니다.
		8. 일반인은 도서 반납시 현재 내가 대여한 도서번호를 입력하여 반납을 진행합니다.
		9. 일반인은 내가 대여한 모든 도서 현황을 출력합니다.
		10. 로그아웃을 제공합니다.
		11. 회원과 도서 정보 멤버변수는 각 3개 이상씩 하여 진행합니다.
					1.회원가입     										    2.로그인
		     1.관리자			2. 일반인		|				1.관리자							        2. 일반인
              		    				|	1. 도서등록   2.도서목록    3.로그아웃      1. 도서대여     2.도서반납    3.대여현황   4.로그아웃
 */
public class Example1 {

}
